
{
    "dato" : {
        "keywords" : [
            "dato", "datos", "curiosidad", "curioso", "información"
        ],
        "respuestas" :[
            "Hitler jamás subió a la Torre Eiffel por flojera",
            "Existen dos países donde no se puede comprar Coca Cola. Cuba y Corea del Norte",
            "La cara de Al Pacino fue el primer logo de Facebook",
            "Antes se creía que la fotografía capturaba el alma de las personas",
            "El nombre de la película 'El Padrino' es una homenaje a Mario Benedetti"
        ]
    },
    "chiste": {
        "keywords" : [
            "chiste", "chistes", "joke", "jokes", "humor", "humoresco", "broma"
        ],
        "respuestas":[
                "Solo hay 10 tipos de personas: Las que saben binario y las que no",
                "Si una persona se divorcia de su esposa, ¿qué pasa con su esposa?",
                "¿Qué le menciona una IP a otra?  ¿Qué tramas?",
                "¿Qué es un terapeuta? – 1024 Gigapeutas.",
                "¿Que le habla un bit al otro? Nos vemos en el bus.",
                "¿Cuántos programadores hacen falta para cambiar una bombilla?  Ninguno, porque es un problema hardware.",
                "¿Pero qué haces tirando esos portátiles al río? ! pero mira como beben los PC,s en el rió!.",
                "¿Qué le dice un .GIF a un .JPEG? Anímate viejo.",
                "¿Cuál es la diferencia entre batman y Bill Gates? Que cuando batman luchó contra el pingüino ganó."
        ]
    },
    "error": [
        "No entiendo tu pregunta, intenta de nuevo",
        "Si utilizas otra combinación de palabras tal vez pueda entenderte",
        "No nos estamos entendiendo",
        "No lo sé, espero ayudarte la próxima vez",
        "No entiendo, ¿podrías repetirlo?"
    ],
    "definicion":{
        "keywords" : [
            "eres", "es", "quien eres", "como estas hecho", "que eres"
        ],
        "respuestas":[
            "Soy un sistema creado con Python que utiliza una base de conocimiento para responder a tus preguntas"
        ]
    },
    "gusto" : {
        "keywords" : [
            "gusta", "gusto", "gustas"
        ],
        "respuestas" :     [
            "Me gusta dar la bienvenida",
            "Me gusta hablar con los demás",
            "Me gusta la física y la química",
            "Me gusta la música",
            "Me gusta la programación",
            "Me gusta la tecnología",
            "Me gusta no responder este tipo de preguntas"
        ]
    }

    

}